module.exports = katakanize;

var commonPairs = {
  'а': 'ア',
  'и': 'イ',
  'у': 'ウ',
  'э': 'エ',
  'о': 'オ',

  'ка': 'カ',
  'ки': 'キ',
  'ку': 'ク',
  'кэ': 'ケ',
  'ко': 'コ',

  'са': 'サ',
  'щи': 'シ',
  'су': 'ス',
  'сэ': 'セ',
  'со': 'ソ',

  'та': 'タ',
  'чи': 'チ',
  'цу': 'ツ',
  'тэ': 'テ',
  'то': 'ト',

  'на': 'ナ',
  'ни': 'ニ',
  'ну': 'ヌ',
  'нэ': 'ネ',
  'но': 'ノ',

  'ха': 'ハ',
  'хи': 'ヒ',
  'фу': 'フ',
  'хэ': 'ヘ',
  'хо': 'ホ',

  'ма': 'マ',
  'ми': 'ミ',
  'му': 'ム',
  'мэ': 'メ',
  'мо': 'モ',

  'я': 'ヤ',
  'ю': 'ユ',
  'ё': 'ヨ',

  'ра': 'ラ',
  'ри': 'リ',
  'ру': 'ル',
  'рэ': 'レ',
  'ро': 'ロ',

  'па': 'パ',
  'пи': 'ピ',
  'пу': 'プ',
  'пэ': 'ペ',
  'по': 'ポ',

  'ба': 'バ',
  'би': 'ビ',
  'бу': 'ブ',
  'бэ': 'ベ',
  'бо': 'ボ',

  'да': 'ダ',
  'дзи': 'ヂ',
  'дзу': 'ヅ',
  'дэ': 'デ',
  'до': 'ド',

  'за': 'ザ',
  'зи': 'ジ',
  'зу': 'ズ',
  'зэ': 'ゼ',
  'зо': 'ゾ',

  'га': 'ガ',
  'ги': 'ギ',
  'гу': 'グ',
  'гэ': 'ゲ',
  'го': 'ゴ',

  'н': 'ン',
  'м': 'ン',

  'кя': 'キャ',
  'кю': 'キュ',
  'кё': 'キョ',

  'ся': 'シャ',
  'сю': 'シュ',
  'сё': 'ショ',

  'тя': 'チャ',
  'тю': 'チュ',
  'тё': 'チョ',

  'ня': 'ニャ',
  'ню': 'ニュ',
  'нё': 'ニョ',

  'хя': 'ヒャ',
  'хю': 'ヒュ',
  'хё': 'ヒョ',

  'мя': 'ミャ',
  'мю': 'ミュ',
  'мё': 'ミョ',

  'ря': 'リャ',
  'рю': 'リュ',
  'рё': 'リョ',

  'пя': 'ピャ',
  'пю': 'ピュ',
  'пё': 'ピョ',

  'бя': 'ビャ',
  'бю': 'ビュ',
  'бё': 'ビョ',

  'дя': 'ヂャ',
  'дю': 'ヂュ',
  'дё': 'ヂョ',

  'дзя': 'ジャ',
  'дзю': 'ジュ',
  'дзё': 'ジョ',

  'гя': 'ギャ',
  'гю': 'ギュ',
  'гё': 'ギョ',

  '+': 'ッ'
};

var smartPairs = {
  // 'уо': 'ヲ',
  'уо': 'ウォ',

  'ва': 'ヴァ',
  'ви': 'ヴィ',
  'ву': 'ヴ',
  'вэ': 'ヴェ',
  'во': 'ヴォ',

  'уа': 'ワ',
  'уи': 'ウィ',
  'уэ': 'ウェ',

  'фа': 'ファ',
  'фи': 'フィ',
  'фэ': 'フェ',
  'фо': 'フォ',

  'чэ': 'チェ',

  'ди': 'ディ',
  'ду': 'ドゥ',

  'ти': 'ティ',
  'ту': 'トゥ',

  'ца': 'ツァ',
  'ци': 'ツィ',
  'цо': 'ツォ',
  'цэ': 'ツェ',
  'цы': 'ツィ',

  'жа': 'ジァ',
  'жэ': 'ジェ',

  'шэ': 'シェ',

  'сы': 'スィ',
  'ты': 'ティ',

  'зэ': 'ジェ',

  'шэ': 'シェ'
};

function katakanize (syllable, index, syllables) {
  if (smartPairs[syllable] && this.smart) {
    return smartPairs[syllable];
  }
  if (commonPairs[syllable]) {
    return commonPairs[syllable];
  }
  return syllable;
}
